# Errores
error.message.permisos=No t\u00E9 els permisos necessaris per a accedir a esta funcionalitat.
error.message.session=La seua sessi\u00F3 ha caducat.


# Errores Generales
error.general.noUsuario=No t\u00E9 usuari per a entrar en esta aplicaci\u00F3, sol\u00B7licite-ho al seu administrador.
error.general.noPermiso=No t\u00E9 permisos per a realitzar esta acci\u00F3.
error.general.registroModificado=El registre actual ha sigut modificat per un altre usuari.
error.general.sistema=Ha ocorregut un error en el sistema, contacte amb el seu administrador.
error.general.usuarioExiste=El loguet d'usuari ja existix, introdu\u00EFsca un altre.

# Errores de Especificos
error.company.noSelectCompany=Error a l'obtindre de BBDD l'empresa sol\u00B7licitada per al seu modificaci\u00F3
error.center.noSelectCenter=Error a l'obtindre de BBDD el centre sol\u00B7licitat per al seu modificaci\u00F3
error.area.noSelectArea=Error a l'obtindre de BBDD l'\u00E0rea sol\u00B7licitada per al seu modificaci\u00F3
error.installation.noSelectInstallation=Error a l'obtindre de BBDD la instal\u00B7laci\u00F3 sol\u00B7licitada per al seu modificaci\u00F3
error.element.noSelectElement=Error a l'obtindre de BBDD l'element sol\u00B7licitat per al seu modificaci\u00F3
error.station.noSelectStation=Error a l'obtindre de BBDD l'estaci\u00F3 sol\u00B7licitada per al seu modificaci\u00F3
error.task.noSelectTask=Error a l'obtindre de BBDD la tasca sol\u00B7licitada per al seu modificaci\u00F3
error.worker.noSelectWorker=Error a l'obtindre de BBDD el treballador sol\u00B7licitat per al seu modificaci\u00F3
error.actionPlan.noSelectActionPlan=Error a l'obtindre de BBDD l'acci\u00F3 sol\u00B7licitada per al seu modificaci\u00F3
error.departament.noSelectDepartament=Error a l'obtindre de BBDD el departament sol\u00B7licitat per al seu modificaci\u00F3
error.event.noSelectEvent=Error a l'obtindre de BBDD l'esdeveniment sol\u00B7licitat per al seu modificaci\u00F3
error.profile.noSelectProfile=Error a l'obtindre de BBDD el perfil sol\u00B7licitat per al seu modificaci\u00F3
error.profile.permissions=Error a l'obtindre de BBDD un llistat de perfils amb els seus corresponents perfils
error.taskBook.noSelectTaskBook=Error a l'obtindre de BBDD l'agenda sol\u00B7licitada per al seu modificaci\u00F3
error.typeAction.noSelectTypeAction=Error a l'obtindre de BBDD el tipus d'acci\u00F3 sol\u00B7licitat per al seu modificaci\u00F3
error.typeEvent.noSelectTypeEvent=Error a l'obtindre de BBDD el tipus d'esdeveniment sol\u00B7licitat per al seu modificaci\u00F3
error.user.noSelectUser=Error a l'obtindre de BBDD l'usuari sol\u00B7licitat per al seu modificaci\u00F3
error.evaluator.noSelectEvaluator=Error a l'obtindre de BBDD l'avaluador sol\u00B7licitat
error.model.noSelectModel=Error a l'obtindre de BBDD el model sol\u00B7licitat
error.login.noSelectCompany=Error a l'intentar visualitzar els detalls de l'empresa seleccionada.
error.company.noSelectCompanyORUser=Error al preparar la llista de les empreses de l'usuari
error.validator.descTipoUsuario= Descripci\u00F3
error.tipoUsuario.Duplicated= La descripci\u00F3 triada per al nou perfil d'usuari ja esta especificada.
error.keyword.noSelectKeyword= Error al mofdificar un keyword
error.forElemMul.noSelectForElemMul= Error al modificar un registre de format d'element multim\u00E8dia.
error.message.constraintViolation=El registre que intenta inserir o eliminar est\u00E0 referenciat en Base de Dades
error.captcha= El codi verificació introduït no és correcte. Per favor torne a intentar-ho


Message.tamaño.error= Tamaño de archivo no válido.
Message.extension.error= Tipus d'arxiu no v\u00E0lid.
Message.extension.FLV= Tipus d'arxiu de v\u00EDdeo no v\u00E0lid.
Message.nombreLargo.error= Nom de l'arxiu massa llarg
# Errores de usuario
error.usuario.idNulo="No hi ha l'usuari introdu\u00EFt.
error.usuario.noUsuarioSeleccionado=Ha de seleccionar un usuari
error.usuario.errorEnPerfiles=Ha ocorregut un error a l'associar perfils, torne a intentar-ho o parle amb el seu administrador

 
# Errores de Imagenes
error.exists.imagen=No s'ha especificat imatge o no existix.
error.exists.dibujoEspecie=No s'ha especificat el dibuix a escala associat a l'esp\u00E8cie o no existix.
error.exists.imagenEspecie=No s'ha especificat la imatge associada a l'esp\u00E8cie o no existix.
error.tipo.imagen=Error al comprovar el tipus d'imatge.
error.max.size=No s'ha pogut obtindre la grand\u00E0ria m\u00E0xima perm\u00E9s.
error.max.size.allow=S'ha excedit la grand\u00E0ria m\u00E0xima per a la imatge.
error.directorio.imagen=No s'ha pogut obtindre el directori d'imatges.
error.copy.imagem=No s'ha pogut copiar la imatge.
error.textoEnImagenNoValido=El text introdu\u00EFt \u00E9s massa llarg per a un r\u00E8tol.

# Errores en la generacion de pdf
error.message.evaluationElement.pdf.genetared=Error en la generaci\u00F3 del pdf d'elements.
error.message.evaluationStation.pdf.genetared=Error en la generaci\u00F3 del pdf de llocs de treball.
error.message.evaluationInstall.pdf.genetared=Error en la generaci\u00F3 del pdf d'instal\u00B7lacions.
error.message.taskBooks.pdf.genetared=Error en la generaci\u00F3 del pdf d'agendes.
error.message.evaluationCenter.pdf.genetared=Error en la generaci\u00F3 del pdf de plans d'acci\u00F3 per centre.
error.message.evaluationWorkerRisk.pdf.genetared=Error en la generaci\u00F3 del pdf d'avaluaci\u00F3 de riscos per treballador
error.message.monitoringResumeStation.pdf.genetared=Error en la generaci\u00F3 del pdf de seguiment d'una avaluaci\u00F3 d'un lloc de treball.
error.message.monitoringResumeInstall.pdf.genetared=Error en la generaci\u00F3 del pdf de seguiment d'una avaluaci\u00F3 d'un lloc de treball.
